// src/core/components/VerifiedBadge.jsx

const VerifiedBadge = () => {
    return (
        <svg viewBox="0 0 12 13" width="16" height="16" fill="currentColor" style={{ color: '#0866ff', marginLeft: "7px" }}
            className="x14rh7hd x1lliihq x1tzjh5l x1k90msu x2h7rmj x1qfuztq" >

            <g fillRule="evenodd" transform="translate(-98 -917)"><title>Tài khoản đã xác minh</title>
                <path
                    d="m106.853 922.354-3.5 3.5a.499.499 0 0 1-.706 0l-1.5-1.5a.5.5 0 1 1 .706-.708l1.147 1.147 3.147-3.147a.5.5 0 1 1 .706.708m3.078 2.295-.589-1.149.588-1.15a.633.633 0 0 0-.219-.82l-1.085-.7-.065-1.287a.627.627 0 0 0-.6-.603l-1.29-.066-.703-1.087a.636.636 0 0 0-.82-.217l-1.148.588-1.15-.588a.631.631 0 0 0-.82.22l-.701 1.085-1.289.065a.626.626 0 0 0-.6.6l-.066 1.29-1.088.702a.634.634 0 0 0-.216.82l.588 1.149-.588 1.15a.632.632 0 0 0 .219.819l1.085.701.065 1.286c.014.33.274.59.6.604l1.29.065.703 1.088c.177.27.53.362.82.216l1.148-.588 1.15.589a.629.629 0 0 0 .82-.22l.701-1.085 1.286-.064a.627.627 0 0 0 .604-.601l.065-1.29 1.088-.703a.633.633 0 0 0 .216-.819">
                </path>
            </g>
        </svg>
    );
};

export default VerifiedBadge;